[
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சிக்கு 10 புத்தகங்களை 3 மேசைகளில் சமமாக அடுக்க வேண்டும். ஒரு மேசையில் எத்தனை புத்தகங்கள் இருக்கும், மீதி எவ்வளவு இருக்கும்?",
        "o": ["3 புத்தகங்கள், 1 மீதி", "4 புத்தகங்கள், 0 மீதி", "3 புத்தகங்கள், 0 மீதி", "2 புத்தகங்கள், 4 மீதி"],
        "a": "3 புத்தகங்கள், 1 மீதி"
    },
    {
        "q": "உங்கள் பையில் 5 பேனாக்கள் இருக்கின்றன, ஆனால் 2 மட்டுமே வேலை செய்கின்றன. நீங்கள் 4 நண்பர்களுக்கு ஒரு பேனா கொடுக்க வேண்டும். எத்தனை பேனாக்கள் கூடுதலாக தேவை?",
        "o": ["2", "3", "4", "5"],
        "a": "2"
    },
    {
        "q": "நீங்கள் ஒரு குழு வேலையை முடிக்க 3 மணி நேரம் எடுத்தால், ஆனால் ஒரு நண்பர் உதவினால் 2 மணி நேரத்தில் முடிக்கலாம். எவ்வளவு நேரம் மிச்சமாகும்?",
        "o": ["1 மணி நேரம்", "2 மணி நேரம்", "3 மணி நேரம்", "4 மணி நேரம்"],
        "a": "1 மணி நேரம்"
    },
    {
        "q": "நீங்கள் ஒரு தோட்டத்தில் 12 மரங்களை 3 வரிசைகளில் நட வேண்டும், ஒரு வரிசையில் 4 மரங்கள். எத்தனை மரங்கள் நடப்படும்?",
        "o": ["8", "10", "12", "14"],
        "a": "12"
    },
    {
        "q": "ஒரு புதிய விளையாட்டு மைதானத்திற்கு செல்ல 2 வழிகள் உள்ளன. முதல் வழி 15 நிமிடங்கள், இரண்டாவது வழி 10 நிமிடங்கள் ஆகும். நீங்கள் முதல் வழியை தேர்ந்தெடுத்தால், எவ்வளவு கூடுதல் நேரம் ஆகும்?",
        "o": ["5 நிமிடங்கள்", "10 நிமிடங்கள்", "15 நிமிடங்கள்", "20 நிமிடங்கள்"],
        "a": "5 நிமிடங்கள்"
    },
    {
        "q": "நீங்கள் 20 ரூபாய் வைத்திருக்கிறீர்கள். ஒரு புத்தகம் 12 ரூபாய். நீங்கள் ஒரு புத்தகம் வாங்கினால், மீதி எவ்வளவு இருக்கும்?",
        "o": ["6 ரூபாய்", "8 ரூபாய்", "10 ரூபாய்", "12 ரூபாய்"],
        "a": "8 ரூபாய்"
    },
    {
        "q": "நீங்கள் ஒரு கயிறை 3 சமமான பகுதிகளாக வெட்ட வேண்டும். கயிறு 9 மீட்டர் நீளம். ஒரு பகுதி எவ்வளவு நீளம் இருக்கும்?",
        "o": ["2 மீட்டர்", "3 மீட்டர்", "4 மீட்டர்", "5 மீட்டர்"],
        "a": "3 மீட்டர்"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 2 மணி நேரத்தில் சரி செய்ய முடியும், ஆனால் உங்கள் நண்பர் 3 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/2", "1/3", "1/5", "1/6"],
        "a": "1/2"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு உருவாக்க வேண்டும். 4 வீரர்கள், 2 குழுக்களாக பிரிக்கப்பட வேண்டும். எத்தனை வழிகளில் இதை செய்யலாம்?",
        "o": ["3", "4", "6", "8"],
        "a": "6"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 5 நாட்களில் உருவாக்க முடியும். ஒரு நண்பர் உதவினால் 3 நாட்களில் முடிக்கலாம். எவ்வளவு நாட்கள் மிச்சமாகும்?",
        "o": ["1 நாள்", "2 நாட்கள்", "3 நாட்கள்", "4 நாட்கள்"],
        "a": "2 நாட்கள்"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு மைதானத்திற்கு செல்ல 2 கிலோமீட்டர் நடக்க வேண்டும். ஒரு கிலோமீட்டருக்கு 15 நிமிடங்கள் ஆகும். மொத்தம் எவ்வளவு நேரம் ஆகும்?",
        "o": ["15 நிமிடங்கள்", "20 நிமிடங்கள்", "30 நிமிடங்கள்", "45 நிமிடங்கள்"],
        "a": "30 நிமிடங்கள்"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 4 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 6 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/4", "1/6", "1/10", "1/12"],
        "a": "1/4"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 3 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 4 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/3", "1/4", "1/7", "1/12"],
        "a": "1/3"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு உருவாக்க வேண்டும். 6 வீரர்கள், 2 குழுக்களாக பிரிக்கப்பட வேண்டும். எத்தனை வழிகளில் இதை செய்யலாம்?",
        "o": ["10", "15", "20", "25"],
        "a": "10"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 2 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 4 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/2", "1/4", "1/6", "1/8"],
        "a": "1/2"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 5 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 10 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/5", "1/10", "1/15", "1/20"],
        "a": "1/5"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு மைதானத்திற்கு செல்ல 3 கிலோமீட்டர் நடக்க வேண்டும். ஒரு கிலோமீட்டருக்கு 12 நிமிடங்கள் ஆகும். மொத்தம் எவ்வளவு நேரம் ஆகும்?",
        "o": ["24 நிமிடங்கள்", "36 நிமிடங்கள்", "48 நிமிடங்கள்", "60 நிமிடங்கள்"],
        "a": "36 நிமிடங்கள்"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 3 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 6 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/3", "1/6", "1/9", "1/12"],
        "a": "1/3"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 4 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 8 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/4", "1/8", "1/12", "1/16"],
        "a": "1/4"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு உருவாக்க வேண்டும். 8 வீரர்கள், 2 குழுக்களாக பிரிக்கப்பட வேண்டும். எத்தனை வழிகளில் இதை செய்யலாம்?",
        "o": ["28", "35", "42", "56"],
        "a": "35"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 2 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 3 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/2", "1/3", "1/5", "1/6"],
        "a": "1/2"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 6 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 12 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/6", "1/12", "1/18", "1/24"],
        "a": "1/6"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு மைதானத்திற்கு செல்ல 4 கிலோமீட்டர் நடக்க வேண்டும். ஒரு கிலோமீட்டருக்கு 10 நிமிடங்கள் ஆகும். மொத்தம் எவ்வளவு நேரம் ஆகும்?",
        "o": ["30 நிமிடங்கள்", "40 நிமிடங்கள்", "50 நிமிடங்கள்", "60 நிமிடங்கள்"],
        "a": "40 நிமிடங்கள்"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 3 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 4 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/3", "1/4", "1/7", "1/12"],
        "a": "1/3"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 5 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 15 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/5", "1/15", "1/20", "1/30"],
        "a": "1/5"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு உருவாக்க வேண்டும். 10 வீரர்கள், 2 குழுக்களாக பிரிக்கப்பட வேண்டும். எத்தனை வழிகளில் இதை செய்யலாம்?",
        "o": ["45", "55", "65", "75"],
        "a": "45"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 2 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 5 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/2", "1/5", "1/7", "1/10"],
        "a": "1/2"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 7 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 14 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/7", "1/14", "1/21", "1/28"],
        "a": "1/7"
    },
    {
        "q": "நீங்கள் ஒரு புதிய விளையாட்டு மைதானத்திற்கு செல்ல 5 கிலோமீட்டர் நடக்க வேண்டும். ஒரு கிலோமீட்டருக்கு 8 நிமிடங்கள் ஆகும். மொத்தம் எவ்வளவு நேரம் ஆகும்?",
        "o": ["32 நிமிடங்கள்", "40 நிமிடங்கள்", "48 நிமிடங்கள்", "56 நிமிடங்கள்"],
        "a": "40 நிமிடங்கள்"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 4 மணி நேரத்தில் சரி செய்ய முடியும். உங்கள் நண்பர் 8 மணி நேரத்தில் சரி செய்ய முடியும். ஒரு மணி நேரத்தில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/4", "1/8", "1/12", "1/16"],
        "a": "1/4"
    },
    {
        "q": "நீங்கள் ஒரு புதிய பொருளை 6 நாட்களில் உருவாக்க முடியும். உங்கள் நண்பர் 18 நாட்களில் உருவாக்க முடியும். ஒரு நாளில் எவ்வளவு வேலை முடிப்பீர்கள்?",
        "o": ["1/6", "1/18", "1/24", "1/36"],
        "a": "1/6"
    }
]