[
    {
        "q": "நீங்கள் ஒரு பள்ளி மாணவர் குழுவின் தலைவர். ஒரு முக்கியமான திட்டத்தில், ஒரு உறுப்பினர் உங்களுக்கு எதிராக மற்றவர்களைத் தூண்டிவிட்டு, உங்கள் முடிவுகளை பகிரங்கமாக கேள்விக்குள்ளாக்குகிறார். ஆனால், அவரது மாற்று யோசனைகள் ஆபத்தானவை மற்றும் நெறிமுறைகளுக்கு முரணானவை. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["அவருடன் தனியாக பேசி, அவரது கவலைகளைக் கேட்டு, ஆதாரங்களுடன் எனது முடிவை விளக்குவேன்", "அவரை உடனடியாக குழுவிலிருந்து நீக்குவேன்", "எனது அதிகாரத்தை வலியுறுத்தி, அவரை அமைதிப்படுத்துவேன்", "அவரது எதிர்ப்பை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "அவருடன் தனியாக பேசி, அவரது கவலைகளைக் கேட்டு, ஆதாரங்களுடன் எனது முடிவை விளக்குவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் தனது பணிகளை முடிக்கவில்லை, ஆனால் அவர் கடுமையான மன அழுத்தத்தில் உள்ளார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["அவருக்கு ஆதரவு வழங்கி, பணிகளை மறு ஒதுக்கீடு செய்து, தேவைப்படும் உதவியைப் பரிந்துரைப்பேன்", "அவரை பகிரங்கமாக விமர்சித்து, பணிகளை முடிக்க வற்புறுத்துவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "அவரது மன அழுத்தத்தை புறக்கணித்து, பணிகளைத் தொடரச் சொல்வேன்"],
        "a": "அவருக்கு ஆதரவு வழங்கி, பணிகளை மறு ஒதுக்கீடு செய்து, தேவைப்படும் உதவியைப் பரிந்துரைப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் கவுன்சில் தலைவர். ஒரு குழு உறுப்பினர் ஒரு நெறிமுறை மீறலை மறைக்க முயல்கிறார், இது திட்டத்தின் நம்பகத்தன்மையை பாதிக்கும். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["மீறலை ஆசிரியரிடம் வெளிப்படுத்தி, பொறுப்பை ஏற்று, திருத்த நடவடிக்கைகளை முன்மொழிவேன்", "மீறலை மறைத்து, திட்டத்தைத் தொடருவேன்", "அந்த உறுப்பினரை மட்டும் குறை கூறி, குழுவிலிருந்து நீக்குவேன்", "மீறலை புறக்கணித்து, மற்றவர்களை கவனிக்கச் சொல்வேன்"],
        "a": "மீறலை ஆசிரியரிடம் வெளிப்படுத்தி, பொறுப்பை ஏற்று, திருத்த நடவடிக்கைகளை முன்மொழிவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி திட்டத் தலைவர். உங்கள் குழு ஒரு பெரிய தோல்வியை சந்திக்கிறது, மேலும் உறுப்பினர்கள் உங்களை குறை கூறுகின்றனர். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி முன்னேறுவீர்கள்?",
        "o": ["தோல்வியிலிருந்து கற்று, குழுவுடன் புதிய உத்திகளை உருவாக்கி, ஒற்றுமையை மீட்டெடுப்பேன்", "குற்றச்சாட்டுகளுக்கு தற்காப்பு பதில் அளித்து, எனது முடிவுகளை நியாயப்படுத்துவேன்", "திட்டத்தை கைவிடுவேன்", "குற்றச்சாட்டுகளை புறக்கணித்து, தனியாக முன்னேறுவேன்"],
        "a": "தோல்வியிலிருந்து கற்று, குழுவுடன் புதிய உத்திகளை உருவாக்கி, ஒற்றுமையை மீட்டெடுப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் உங்களுக்கு எதிராக பொய்யான புரளியைப் பரப்பி, குழு ஒற்றுமையை பாதிக்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["உண்மையை ஆதாரங்களுடன் தெளிவுபடுத்தி, குழுவுடன் திறந்த உரையாடல் நடத்துவேன்", "திருப்பி புரளி பரப்புவேன்", "அவரை உடனடியாக குழுவிலிருந்து நீக்குவேன்", "புரளியை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "உண்மையை ஆதாரங்களுடன் தெளிவுபடுத்தி, குழுவுடன் திறந்த உரையாடல் நடத்துவேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். ஒரு உறுப்பினர் உங்களை பகிரங்கமாக அவமதித்து, உங்கள் தலைமையை கேள்விக்குள்ளாக்குகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["அமைதியாக அவருடன் தனியாக பேசி, அவரது கவலைகளைப் புரிந்து, ஒத்துழைப்பை ஊக்குவிப்பேன்", "திருப்பி அவமதித்து, எனது அதிகாரத்தை வலியுறுத்துவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "அவமதிப்பை புறக்கணித்து, தொடர்ந்து தலைமை வகிப்பேன்"],
        "a": "அமைதியாக அவருடன் தனியாக பேசி, அவரது கவலைகளைப் புரிந்து, ஒத்துழைப்பை ஊக்குவிப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். உங்கள் குழு இரண்டு ஆபத்தான உத்திகளுக்கு இடையே முடிவு செய்ய முடியவில்லை, மேலும் காலக்கெடு நெருங்குகிறது. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி முடிவெடுப்பீர்கள்?",
        "o": ["ஆபத்துகளையும் நன்மைகளையும் ஆராய்ந்து, ஆதாரங்களின் அடிப்படையில் ஒரு உத்தியைத் தேர்வு செய்வேன்", "வாக்கெடுப்பு நடத்தி, பெரும்பான்மையின் முடிவை ஏற்பேன்", "முடிவை ஆசிரியரிடம் விட்டுவிடுவேன்", "இரண்டு உத்திகளையும் ஒரே நேரத்தில் முயற்சிப்பேன்"],
        "a": "ஆபத்துகளையும் நன்மைகளையும் ஆராய்ந்து, ஆதாரங்களின் அடிப்படையில் ஒரு உத்தியைத் தேர்வு செய்வேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் தனது திறமைகளை மறைத்து, திட்டத்தின் முன்னேற்றத்தை பாதிக்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["அவருடன் தனியாக பேசி, அவரது திறமைகளைப் பயன்படுத்த ஊக்குவித்து, பொருத்தமான பணிகளை ஒதுக்குவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "அவரை பகிரங்கமாக விமர்சித்து, பங்களிக்க வற்புறுத்துவேன்", "அவரது பங்களிப்பின்மையை புறக்கணித்து, மற்றவர்களை நம்புவேன்"],
        "a": "அவருடன் தனியாக பேசி, அவரது திறமைகளைப் பயன்படுத்த ஊக்குவித்து, பொருத்தமான பணிகளை ஒதுக்குவேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் கவுன்சில் தலைவர். ஒரு உறுப்பினர் உங்களை தவறாகப் புரிந்து கொண்டு, உங்கள் நோக்கத்தை கேள்விக்குள்ளாக்குகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["தெளிவாக எனது நோக்கத்தை விளக்கி, அவரது கவலைகளைக் கேட்டு, புரிதலை உறுதி செய்வேன்", "அவரை பகிரங்கமாக விமர்சித்து, எனது முடிவை நியாயப்படுத்துவேன்", "புரிதல் பிரச்சனையை புறக்கணித்து, தொடர்ந்து தலைமை வகிப்பேன்", "எனது நிலைப்பாட்டை வலியுறுத்தி, விவாதத்தை முடிப்பேன்"],
        "a": "தெளிவாக எனது நோக்கத்தை விளக்கி, அவரது கவலைகளைக் கேட்டு, புரிதலை உறுதி செய்வேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி திட்டத் தலைவர். உங்கள் குழு உறுப்பினர்கள் மிகவும் மன அழுத்தத்தில் உள்ளனர், மேலும் உற்பத்தித்திறன் குறைகிறது. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["இடைவேளைகளை அறிமுகப்படுத்தி, மன அழுத்தத்தை குறைக்க ஆதரவு வழங்கி, பணிகளை மறு ஒதுக்கீடு செய்வேன்", "கடுமையான காலக்கெடுகளை அமைத்து, வேலை செய்ய வற்புறுத்துவேன்", "திட்டத்தை தற்காலிகமாக நிறுத்துவேன்", "ஆசிரியரிடம் உதவி கேட்டு, முழு பொறுப்பையும் அவரிடம் ஒப்படைப்பேன்"],
        "a": "இடைவேளைகளை அறிமுகப்படுத்தி, மன அழுத்தத்தை குறைக்க ஆதரவு வழங்கி, பணிகளை மறு ஒதுக்கீடு செய்வேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் உங்களுக்கு எதிராக மற்றவர்களைத் தூண்டிவிடுகிறார், மேலும் குழு ஒற்றுமை பாதிக்கப்படுகிறது. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["அவருடன் தனியாக பேசி, அவரது கவலைகளைப் புரிந்து, குழு ஒற்றுமையை மீட்டெடுக்க முயற்சிப்பேன்", "அவரை உடனடியாக குழுவிலிருந்து நீக்குவேன்", "மற்றவர்களை எதிர்த்து பேசி, எனது நிலைப்பாட்டை வலியுறுத்துவேன்", "பிரச்சனையை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "அவருடன் தனியாக பேசி, அவரது கவலைகளைப் புரிந்து, குழு ஒற்றுமையை மீட்டெடுக்க முயற்சிப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். ஒரு உறுப்பினர் தனது பணிகளை மற்றவர்களுக்கு திணித்து, குழு ஒற்றுமையை பாதிக்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["பணிகளை நியாயமாக மறு ஒதுக்கீடு செய்து, ஒத்துழைப்பின் முக்கியத்துவத்தை விளக்குவேன்", "அவரை பணிகளைத் திணிக்க அனுமதித்து, மற்றவர்களை சமாளிக்கச் சொல்வேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "நடத்தையை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "பணிகளை நியாயமாக மறு ஒதுக்கீடு செய்து, ஒத்துழைப்பின் முக்கியத்துவத்தை விளக்குவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். ஒரு உறுப்பினர் உங்களுக்கு தவறான ஆலோசனையை வழங்கி, திட்டத்தை திசைதிருப்ப முயல்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["ஆலோசனையை ஆராய்ந்து, ஆதாரங்களுடன் உண்மையை விளக்கி, சரியான பாதையில் தொடருவேன்", "ஆலோசனையை ஏற்று, அவரை முழுமையாக நம்புவேன்", "அவரை பகிரங்கமாக விமர்சித்து, ஆலோசனையை நிராகரிப்பேன்", "ஆலோசனையை புறக்கணித்து, எனது திட்டத்தைத் தொடருவேன்"],
        "a": "ஆலோசனையை ஆராய்ந்து, ஆதாரங்களுடன் உண்மையை விளக்கி, சரியான பாதையில் தொடருவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் உங்களை பகிரங்கமாக சவால் செய்கிறார், ஆனால் அவரது மாற்று யோசனை ஆபத்தானது. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["அவரது யோசனையை ஆராய்ந்து, ஆபத்துகளை ஆதாரங்களுடன் விளக்கி, எனது முடிவை நியாயப்படுத்துவேன்", "அவரை உடனடியாக குழுவிலிருந்து நீக்குவேன்", "எனது அதிகாரத்தை வலியுறுத்தி, விவாதத்தை முடிப்பேன்", "சவாலை புறக்கணித்து, தொடர்ந்து ஒருங்கிணைப்பேன்"],
        "a": "அவரது யோசனையை ஆராய்ந்து, ஆபத்துகளை ஆதாரங்களுடன் விளக்கி, எனது முடிவை நியாயப்படுத்துவேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். உங்கள் குழு ஒரு முக்கியமான வாய்ப்பை இழந்து, உறுப்பினர்கள் உங்களை குறை கூறுகின்றனர். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["புதிய வாய்ப்புகளைத் தேடி, குழுவை மறு உத்திகளுடன் ஒருங்கிணைத்து, ஒற்றுமையை மீட்டெடுப்பேன்", "குற்றச்சாட்டுகளுக்கு தற்காப்பு பதில் அளித்து, எனது முடிவுகளை நியாயப்படுத்துவேன்", "திட்டத்தை கைவிடுவேன்", "குற்றச்சாட்டுகளை புறக்கணித்து, தனியாக முன்னேறுவேன்"],
        "a": "புதிய வாய்ப்புகளைத் தேடி, குழுவை மறு உத்திகளுடன் ஒருங்கிணைத்து, ஒற்றுமையை மீட்டெடுப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். ஒரு உறுப்பினர் உங்களை தவறாகப் புரிந்து கொண்டு, உங்கள் முடிவுகளை எதிர்க்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["தெளிவாக எனது முடிவுகளை விளக்கி, அவரது கவலைகளைக் கேட்டு, ஒருமித்து முன்னேறுவேன்", "அவரை பகிரங்கமாக விமர்சித்து, எனது முடிவை வலியுறுத்துவேன்", "புரிதல் பிரச்சனையை புறக்கணித்து, தொடர்ந்து தலைமை வகிப்பேன்", "எனது முடிவை மாற்றி, அவரது கருத்தை ஏற்பேன்"],
        "a": "தெளிவாக எனது முடிவுகளை விளக்கி, அவரது கவலைகளைக் கேட்டு, ஒருமித்து முன்னேறுவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் தனது தவறை ஒப்புக்கொள்ள மறுத்து, மற்றவர்களை குறை கூறுகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["அவருடன் தனியாக பேசி, பொறுப்பை ஏற்க வழிகாட்டி, குழு ஒற்றுமையை மீட்டெடுப்பேன்", "அவரை பகிரங்கமாக குறை கூறி, தவறை சுட்டிக்காட்டுவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "தவறை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "அவருடன் தனியாக பேசி, பொறுப்பை ஏற்க வழிகாட்டி, குழு ஒற்றுமையை மீட்டெடுப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். உங்கள் குழு உறுப்பினர்கள் முடிவெடுக்க பயப்படுகின்றனர், மேலும் பொறுப்பை உங்களுக்கு தள்ளுகின்றனர். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["அவர்களுக்கு நம்பிக்கையூட்டி, ஒத்துழைப்பு முடிவெடுப்பை ஊக்குவித்து, அனைவரையும் ஈடுபடுத்துவேன்", "நானே அனைத்து முடிவுகளையும் எடுத்து, குழுவை வழிநடத்துவேன்", "அவர்களை விமர்சித்து, முடிவெடுக்க வற்புறுத்துவேன்", "முடிவை ஆசிரியரிடம் விட்டுவிடுவேன்"],
        "a": "அவர்களுக்கு நம்பிக்கையூட்டி, ஒத்துழைப்பு முடிவெடுப்பை ஊக்குவித்து, அனைவரையும் ஈடுபடுத்துவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். ஒரு உறுப்பினர் உங்களுக்கு எதிராக மற்றவர்களை ஆதிக்கம் செலுத்த முயல்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["எல்லோருக்கும் சமமான வாய்ப்பு வழங்கி, ஒத்துழைப்பை வலியுறுத்தி, ஆதிக்க நடத்தையை முடிவுக்கு கொண்டுவருவேன்", "அவரை ஆதிக்கம் செலுத்த அனுமதித்து, மற்றவர்களை சமாளிக்கச் சொல்வேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "நடத்தையை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "எல்லோருக்கும் சமமான வாய்ப்பு வழங்கி, ஒத்துழைப்பை வலியுறுத்தி, ஆதிக்க நடத்தையை முடிவுக்கு கொண்டுவருவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் உங்களுக்கு எதிராக தவறான தகவலைப் பரப்பி, திட்டத்தை பாதிக்கிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["சரியான தகவலை ஆதாரங்களுடன் தெளிவுபடுத்தி, குழுவுடன் திறந்த உரையாடல் நடத்துவேன்", "அவரை பகிரங்கமாக குறை கூறி, தகவலை மறுப்பேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "தகவலை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "சரியான தகவலை ஆதாரங்களுடன் தெளிவுபடுத்தி, குழுவுடன் திறந்த உரையாடல் நடத்துவேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். உங்கள் குழு ஒரு உறுப்பினரை ஒதுக்கி வைத்து, அவரை புறக்கணிக்கிறது. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["அவரை முழுமையாக ஈடுபடுத்தி, அவரது பங்களிப்பை மதித்து, குழு ஒற்றுமையை மீட்டெடுப்பேன்", "ஒதுக்குதலை அனுமதித்து, மற்றவர்களை கவனிப்பேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "பிரச்சனையை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "அவரை முழுமையாக ஈடுபடுத்தி, அவரது பங்களிப்பை மதித்து, குழு ஒற்றுமையை மீட்டெடுப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். உங்கள் குழு உறுப்பினர்கள் உங்களை முழுமையாக நம்பியுள்ளனர், ஆனால் நீங்கள் ஒரு முக்கிய முடிவில் நிச்சயமற்றவராக உள்ளீர்கள். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி முடிவெடுப்பீர்கள்?",
        "o": ["குழுவுடன் ஆலோசித்து, அவர்களின் கருத்துகளை கேட்டு, ஒரு ஒருமித்த முடிவை எடுப்பேன்", "எனது நிச்சயமின்மையை மறைத்து, தனியாக முடிவெடுப்பேன்", "முடிவை தள்ளிப்போடுவேன்", "ஆசிரியரிடம் உதவி கேட்பேன்"],
        "a": "குழுவுடன் ஆலோசித்து, அவர்களின் கருத்துகளை கேட்டு, ஒரு ஒருமித்த முடிவை எடுப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் தனது பங்களிப்பை மிகைப்படுத்தி, மற்றவர்களின் பங்களிப்பை குறைத்து மதிப்பிடுகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["அனைவரின் பங்களிப்பையும் பகிரங்கமாக அங்கீகரித்து, நியாயமான பாராட்டை உறுதி செய்வேன்", "அவரை தனியாக எச்சரித்து, நடத்தையை மாற்ற வற்புறுத்துவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "நடத்தையை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "அனைவரின் பங்களிப்பையும் பகிரங்கமாக அங்கீகரித்து, நியாயமான பாராட்டை உறுதி செய்வேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். உங்கள் குழு உறுப்பினர்கள் ஒருவரையொருவர் பகிரங்கமாக அவமதிக்கின்றனர், இது திட்டத்தை பாதிக்கிறது. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["இருவரையும் தனியாக அழைத்து, மோதலின் காரணத்தை ஆராய்ந்து, ஒத்துழைப்பை ஊக்குவிப்பேன்", "ஒருவரை குழுவிலிருந்து நீக்குவேன்", "மோதலை புறக்கணித்து, திட்டத்தில் கவனம் செலுத்துவேன்", "ஆசிரியரிடம் புகார் செய்வேன்"],
        "a": "இருவரையும் தனியாக அழைத்து, மோதலின் காரணத்தை ஆராய்ந்து, ஒத்துழைப்பை ஊக்குவிப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். உங்கள் குழு ஒரு தவறான முடிவை ஆதரிக்கிறது, இது நீண்டகால பின்விளைவுகளை ஏற்படுத்தும். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["எனது கவலைகளை ஆதாரங்களுடன் விளக்கி, மாற்று முடிவை முன்மொழிவேன்", "குழுவின் முடிவை ஏற்று, தொடர்ந்து தலைமை வகிப்பேன்", "முடிவை ஒருதலைப்படுத்தாக மறுதலித்து, எனது முடிவை திணிப்பேன்", "தலைமையை விட்டு விலகுவேன்"],
        "a": "எனது கவலைகளை ஆதாரங்களுடன் விளக்கி, மாற்று முடிவை முன்மொழிவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் தனது கடினமான தனிப்பட்ட சூழ்நிலைகளால் பணிகளை முடிக்க முடியவில்லை. உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["அவருக்கு ஆதரவு வழங்கி, பணிகளை மறு ஒதுக்கீடு செய்து, தேவைப்படும் உதவியைப் பரிந்துரைப்பேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "அவரை விமர்சித்து, பணிகளை முடிக்க வற்புறுத்துவேன்", "பிரச்சனையை புறக்கணித்து, மற்றவர்களை நம்புவேன்"],
        "a": "அவருக்கு ஆதரவு வழங்கி, பணிகளை மறு ஒதுக்கீடு செய்து, தேவைப்படும் உதவியைப் பரிந்துரைப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். உங்கள் குழு உறுப்பினர்கள் உற்சாகமின்றி, பணிகளை முடிக்கத் தவறுகின்றனர். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி அவர்களை உற்சாகப்படுத்துவீர்கள்?",
        "o": ["தனிப்பயனாக்கப்பட்ட இலக்குகளை அமைத்து, அவர்களின் முன்னேற்றத்தை அங்கீகரித்து, ஒத்துழைப்பை ஊக்குவிப்பேன்", "கடுமையான காலக்கெடுகளை அமைத்து, வேலை செய்ய வற்புறுத்துவேன்", "பரிசுகளை வாக்குறுதி செய்து, உற்சாகப்படுத்துவேன்", "அவர்களை விமர்சித்து, பணிகளை முடிக்கச் சொல்வேன்"],
        "a": "தனிப்பயனாக்கப்பட்ட இலக்குகளை அமைத்து, அவர்களின் முன்னேற்றத்தை அங்கீகரித்து, ஒத்துழைப்பை ஊக்குவிப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். ஒரு உறுப்பினர் உங்களை பகிரங்கமாக விமர்சித்து, உங்கள் தலைமையை கேள்விக்குள்ளாக்குகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["அவருடன் தனியாக பேசி, அவரது விமர்சனங்களைப் புரிந்து, ஒத்துழைப்பை மீட்டெடுப்பேன்", "திருப்பி விமர்சித்து, எனது அதிகாரத்தை வலியுறுத்துவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "விமர்சனத்தை புறக்கணித்து, தொடர்ந்து தலைமை வகிப்பேன்"],
        "a": "அவருடன் தனியாக பேசி, அவரது விமர்சனங்களைப் புரிந்து, ஒத்துழைப்பை மீட்டெடுப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் தனது பணிகளை முடிக்கவில்லை, ஆனால் அவர் மற்றவர்களை உற்சாகப்படுத்துகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["அவரது உற்சாகத்தை அங்கீகரித்து, பணிகளை மறு ஒதுக்கீடு செய்து, அவரை மற்றவர்களை ஊக்குவிக்கப் பயன்படுத்துவேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "அவரை விமர்சித்து, பணிகளை முடிக்க வற்புறுத்துவேன்", "பணிகளை முடிக்காமல் இருப்பதை புறக்கணித்து, அவரது உற்சாகத்தை மட்டும் பயன்படுத்துவேன்"],
        "a": "அவரது உற்சாகத்தை அங்கீகரித்து, பணிகளை மறு ஒதுக்கீடு செய்து, அவரை மற்றவர்களை ஊக்குவிக்கப் பயன்படுத்துவேன்"
    },
    {
        "q": "நீங்கள் ஒரு மாணவர் தலைவர். உங்கள் குழு ஒரு நெறிமுறை முடிவை எதிர்கொள்கிறது, ஆனால் உறுப்பினர்கள் அதை மீற முயல்கின்றனர். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி நடந்து கொள்வீர்கள்?",
        "o": ["நெறிமுறைகளின் முக்கியத்துவத்தை விளக்கி, மாற்று வழிகளை ஆராய்ந்து, குழுவை சரியான பாதையில் வழிநடத்துவேன்", "மீறலை அனுமதித்து, திட்டத்தைத் தொடருவேன்", "குழுவை கலைத்து, தனியாக முடிவெடுப்பேன்", "மீறலை புறக்கணித்து, மற்றவர்களை முடிவெடுக்க விடுவேன்"],
        "a": "நெறிமுறைகளின் முக்கியத்துவத்தை விளக்கி, மாற்று வழிகளை ஆராய்ந்து, குழுவை சரியான பாதையில் வழிநடத்துவேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி குழு தலைவர். உங்கள் குழு ஒரு முக்கியமான தவறைச் செய்து, ஆசிரியர்கள் உங்களை குறை கூறுகின்றனர். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி பதிலளிப்பீர்கள்?",
        "o": ["பொறுப்பை ஏற்று, தவறை சரிசெய்ய உத்திகளை முன்மொழிந்து, குழுவை மீண்டும் ஒருங்கிணைப்பேன்", "குற்றச்சாட்டுகளை மறுத்து, மற்றவர்களை குறை கூறுவேன்", "தலைமையை விட்டு விலகுவேன்", "குற்றச்சாட்டுகளை புறக்கணித்து, தொடர்ந்து தலைமை வகிப்பேன்"],
        "a": "பொறுப்பை ஏற்று, தவறை சரிசெய்ய உத்திகளை முன்மொழிந்து, குழுவை மீண்டும் ஒருங்கிணைப்பேன்"
    },
    {
        "q": "நீங்கள் ஒரு பள்ளி நிகழ்ச்சி ஒருங்கிணைப்பாளர். ஒரு உறுப்பினர் உங்களுக்கு எதிராக மற்றவர்களை மறைமுகமாக தூண்டிவிடுகிறார். உங்கள் பாத்திரத்தில், நீங்கள் எப்படி கையாளுவீர்கள்?",
        "o": ["அவருடன் தனியாக பேசி, அவரது நடத்தையின் தாக்கத்தை விளக்கி, ஒத்துழைப்பை மீட்டெடுப்பேன்", "அவரை பகிரங்கமாக குறை கூறி, நடத்தையை நிறுத்தச் சொல்வேன்", "அவரை குழுவிலிருந்து நீக்குவேன்", "நடத்தையை புறக்கணித்து, திட்டத்தைத் தொடருவேன்"],
        "a": "அவருடன் தனியாக பேசி, அவரது நடத்தையின் தாக்கத்தை விளக்கி, ஒத்துழைப்பை மீட்டெடுப்பேன்"
    }
]