[
    {
        "q": "ஒரு பள்ளி நிகழ்ச்சிக்கு 3 குழுக்கள் தேவை: A (4 மாணவர்கள்), B (5 மாணவர்கள்), C (3 மாணவர்கள்). ஒவ்வொரு குழுவும் ஒரு தலைவரைத் தேர்ந்தெடுக்க வேண்டும், ஆனால் A-இல் உள்ள மாணவர் X மற்றும் B-இல் உள்ள மாணவர் Y ஒரே நேரத்தில் தலைவர்களாக இருக்கக்கூடாது. சாத்தியமான தலைவர் தேர்வு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["59", "60", "58", "57"],
        "a": "59"
    },
    {
        "q": "ஒரு பள்ளி 3 பயணங்களை (P, Q, R) ஏற்பாடு செய்கிறது. P-இல் 20 மாணவர்கள், Q-இல் 25 மாணவர்கள், R-இல் 15 மாணவர்கள் பங்கேற்கலாம். ஒரு பேருந்து 30 மாணவர்களை ஏற்றிச் செல்ல முடியும், மற்றும் குறைந்தபட்ச பேருந்துகளைப் பயன்படுத்த வேண்டும். எத்தனை பேருந்துகள் தேவை?",
        "o": ["2", "3", "4", "5"],
        "a": "3"
    },
    {
        "q": "ஒரு பள்ளி நிகழ்ச்சிக்கு 4 பணிகள் (A, B, C, D) உள்ளன. A முடிய 3 நாட்கள், B முடிய 4 நாட்கள், C முடிய 2 நாட்கள், D முடிய 5 நாட்கள். B முடிந்த பிறகு C தொடங்க வேண்டும், A மற்றும் C முடிந்த பிறகு D தொடங்க வேண்டும். குறைந்தபட்ச நாட்களைக் கண்டறியவும்.",
        "o": ["11", "12", "13", "14"],
        "a": "12"
    },
    {
        "q": "ஒரு பள்ளி நூலகத்தில் 3 வகை புத்தகங்கள்: அறிவியல் (40%), கணிதம் (35%), இலக்கியம் (25%). ஒரு மாணவர் 2 புத்தகங்களை தோராயமாக எடுக்கிறார். இரண்டும் அறிவியல் புத்தகங்களாக இருக்கும் நிகழ்தகவைக் கண்டறியவும்.",
        "o": ["0.16", "0.12", "0.20", "0.25"],
        "a": "0.16"
    },
    {
        "q": "ஒரு பள்ளி நிகழ்ச்சிக்கு 5 ஆசிரியர்கள் (P, Q, R, S, T) மற்றும் 5 பணிகள் உள்ளன. ஒவ்வொரு ஆசிரியரும் ஒரு பணியை மட்டுமே செய்ய முடியும். P ஆனவர் பணி 1-ஐ செய்ய முடியாது, Q ஆனவர் பணி 2-ஐ செய்ய முடியாது. சாத்தியமான ஒதுக்கீடு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["44", "48", "52", "60"],
        "a": "48"
    },
    {
        "q": "ஒரு பள்ளி 3 நிகழ்ச்சிகளை (X, Y, Z) ஏற்பாடு செய்கிறது. X-இல் 1000 ரூ செலவு, Y-இல் 1500 ரூ செலவு, Z-இல் 2000 ரூ செலவு. மொத்த பட்ஜெட் 4000 ரூ. எந்த இரண்டு நிகழ்ச்சிகளை நடத்த முடியும்?",
        "o": ["X மற்றும் Y", "Y மற்றும் Z", "X மற்றும் Z", "எதுவும் இல்லை"],
        "a": "X மற்றும் Y"
    },
    {
        "q": "ஒரு பள்ளி கண்காட்சிக்கு 4 தலைப்புகள் (A, B, C, D) உள்ளன. A மற்றும் B ஒரே நேரத்தில் தேர்ந்தெடுக்கப்பட முடியாது, C மற்றும் D ஒரே நேரத்தில் தேர்ந்தெடுக்கப்பட வேண்டும். குறைந்தபட்சம் ஒரு தலைப்பு தேர்ந்தெடுக்கப்பட வேண்டும். சாத்தியமான தேர்வு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["5", "6", "7", "8"],
        "a": "6"
    },
    {
        "q": "ஒரு பள்ளியில் 3 வகுப்புகள் (A, B, C) உள்ளன. A-இல் 30 மாணவர்கள், B-இல் 40 மாணவர்கள், C-இல் 50 மாணவர்கள். ஒரு குழுவில் 20 மாணவர்கள் இருக்க வேண்டும், மற்றும் ஒவ்வொரு வகுப்பிலிருந்தும் குறைந்தபட்சம் 5 மாணவர்கள் இருக்க வேண்டும். சாத்தியமான குழு உருவாக்க வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["720", "840", "960", "1080"],
        "a": "960"
    },
    {
        "q": "ஒரு பள்ளி நிகழ்ச்சிக்கு 3 இடங்கள் (P, Q, R) உள்ளன. P-இல் 100 பேர், Q-இல் 150 பேர், R-இல் 200 பேர் அமர முடியும். 400 பேர் பங்கேற்க வேண்டும். குறைந்தபட்ச இடங்களைப் பயன்படுத்தி எந்த இடங்களைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["Q மற்றும் R", "P மற்றும் R", "P மற்றும் Q", "மூன்றும்"],
        "a": "Q மற்றும் R"
    },
    {
        "q": "ஒரு பள்ளி 3 திட்டங்களை (X, Y, Z) மேற்கொள்கிறது. X-இல் 10 மணி நேரம், Y-இல் 15 மணி நேரம், Z-இல் 20 மணி நேரம் தேவை. மொத்தம் 30 மணி நேரம் மட்டுமே உள்ளது. எந்த இரண்டு திட்டங்களை முடிக்க முடியும்?",
        "o": ["X மற்றும் Y", "Y மற்றும் Z", "X மற்றும் Z", "எதுவும் இல்லை"],
        "a": "X மற்றும் Y"
    },
    {
        "q": "ஒரு பள்ளி விழாவுக்கு 4 உணவு வகைகள் (A, B, C, D) உள்ளன. A-இன் விலை 100 ரூ, B-இன் விலை 150 ரூ, C-இன் விலை 200 ரூ, D-இன் விலை 250 ரூ. பட்ஜெட் 400 ரூ. அதிகபட்சம் மூன்று வகைகளைத் தேர்ந்தெடுக்க முடியும். எந்த கலவையைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["A, B, C", "B, C, D", "A, B, D", "A, C, D"],
        "a": "A, B, D"
    },
    {
        "q": "ஒரு பள்ளி 3 ஆசிரியர்களை (P, Q, R) ஒரு நிகழ்ச்சிக்கு ஒதுக்க வேண்டும். P-இன் செலவு 500 ரூ, Q-இன் செலவு 700 ரூ, R-இன் செலவு 900 ரூ. பட்ஜெட் 1500 ரூ. எந்த இரண்டு ஆசிரியர்களைத் தேர்ந்தெடுக்க முடியும்?",
        "o": ["P மற்றும் Q", "Q மற்றும் R", "P மற்றும் R", "எதுவும் இல்லை"],
        "a": "P மற்றும் Q"
    },
    {
        "q": "ஒரு பள்ளி 4 மாணவர் குழுக்களை (A, B, C, D) ஒரு போட்டிக்கு அனுப்புகிறது. A-இல் 3 மாணவர்கள், B-இல் 4 மாணவர்கள், C-இல் 5 மாணவர்கள், D-இல் 6 மாணவர்கள். ஒரு குழுவில் 10 மாணவர்கள் இருக்க வேண்டும். எந்த குழுக்களைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["A மற்றும் C", "B மற்றும் D", "A மற்றும் D", "C மற்றும் D"],
        "a": "B மற்றும் D"
    },
    {
        "q": "ஒரு பள்ளி நிகழ்ச்சிக்கு 3 மேடைகள் (X, Y, Z) உள்ளன. X-இல் 50 பேர், Y-இல் 75 பேர், Z-இல் 100 பேர் அமர முடியும். 150 பேர் பங்கேற்க வேண்டும். குறைந்தபட்ச மேடைகளைப் பயன்படுத்தி எந்த மேடைகளைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["Y மற்றும் Z", "X மற்றும் Z", "X மற்றும் Y", "மூன்றும்"],
        "a": "Y மற்றும் Z"
    },
    {
        "q": "ஒரு பள்ளி 3 தலைமைப் பொறுப்புகளை (P, Q, R) 3 மாணவர்களுக்கு (A, B, C) ஒதுக்க வேண்டும். A ஆனவர் P-ஐ ஏற்க முடியாது, B ஆனவர் Q-ஐ ஏற்க முடியாது. சாத்தியமான ஒதுக்கீடு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["2", "3", "4", "6"],
        "a": "4"
    },
    {
        "q": "ஒரு பள்ளி 4 பயிற்சி அறைகளை (A, B, C, D) ஒதுக்க வேண்டும். A-இல் 20 மாணவர்கள், B-இல் 25 மாணவர்கள், C-இல் 30 மாணவர்கள், D-இல் 35 மாணவர்கள் பயிற்சி பெற முடியும். 70 மாணவர்கள் பயிற்சி பெற வேண்டும். எந்த அறைகளைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["A மற்றும் D", "B மற்றும் C", "C மற்றும் D", "A மற்றும் C"],
        "a": "C மற்றும் D"
    },
    {
        "q": "ஒரு பள்ளி நிகழ்ச்சிக்கு 3 உபகரணங்கள் (X, Y, Z) தேவை. X-இன் விலை 2000 ரூ, Y-இன் விலை 3000 ரூ, Z-இன் விலை 4000 ரூ. பட்ஜெட் 6000 ரூ. எந்த உபகரணங்களைத் தேர்ந்தெடுக்க முடியும்?",
        "o": ["X மற்றும் Y", "Y மற்றும் Z", "X மற்றும் Z", "மூன்றும்"],
        "a": "X மற்றும் Y"
    },
    {
        "q": "ஒரு பள்ளி 3 குழு நிகழ்ச்சிகளை (P, Q, R) ஏற்பாடு செய்கிறது. P-இல் 10 மாணவர்கள், Q-இல் 15 மாணவர்கள், R-இல் 20 மாணவர்கள் பங்கேற்கலாம். ஒரு அரங்கில் 25 மாணவர்கள் அமர முடியும். குறைந்தபட்ச அரங்குகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["2", "3", "4", "5"],
        "a": "3"
    },
    {
        "q": "ஒரு பள்ளி 4 திட்டங்களை (A, B, C, D) மேற்கொள்கிறது. A-இல் 5 மணி நேரம், B-இல் 7 மணி நேரம், C-இல் 10 மணி நேரம், D-இல் 12 மணி நேரம் தேவை. மொத்தம் 20 மணி நேரம் உள்ளது. எந்த திட்டங்களை முடிக்க முடியும்?",
        "o": ["A மற்றும் B", "B மற்றும் C", "A மற்றும் C", "C மற்றும் D"],
        "a": "A மற்றும் B"
    },
    {
        "q": "ஒரு பள்ளி 3 ஆசிரியர்களை (X, Y, Z) 3 பயிற்சி அமர்வுகளுக்கு ஒதுக்க வேண்டும். X ஆனவர் அமர்வு 1-ஐ ஏற்க முடியாது, Y ஆனவர் அமர்வு 2-ஐ ஏற்க முடியாது. சாத்தியமான ஒதுக்கீடு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["2", "3", "4", "6"],
        "a": "4"
    },
    {
        "q": "ஒரு பள்ளி 4 நிகழ்ச்சி இடங்களை (A, B, C, D) ஒதுக்க வேண்டும். A-இல் 50 பேர், B-இல் 75 பேர், C-இல் 100 பேர், D-இல் 125 பேர் அமர முடியும். 200 பேர் பங்கேற்க வேண்டும். எந்த இடங்களைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["C மற்றும் D", "A மற்றும் D", "B மற்றும் C", "A மற்றும் C"],
        "a": "C மற்றும் D"
    },
    {
        "q": "ஒரு பள்ளி 3 விளையாட்டு அணிகளை (X, Y, Z) உருவாக்க வேண்டும். X-இல் 5 மாணவர்கள், Y-இல் 6 மாணவர்கள், Z-இல் 7 மாணவர்கள் இருக்க வேண்டும். மொத்தம் 15 மாணவர்கள் உள்ளனர். எந்த அணிகளை உருவாக்க முடியும்?",
        "o": ["X மற்றும் Y", "Y மற்றும் Z", "X மற்றும் Z", "எதுவும் இல்லை"],
        "a": "X மற்றும் Y"
    },
    {
        "q": "ஒரு பள்ளி 3 கலை நிகழ்ச்சிகளை (P, Q, R) ஏற்பாடு செய்கிறது. P-இல் 2000 ரூ செலவு, Q-இல் 3000 ரூ செலவு, R-இல் 4000 ரூ செலவு. பட்ஜெட் 5000 ரூ. எந்த நிகழ்ச்சிகளை நடத்த முடியும்?",
        "o": ["P மற்றும் Q", "Q மற்றும் R", "P மற்றும் R", "எதுவும் இல்லை"],
        "a": "P மற்றும் Q"
    },
    {
        "q": "ஒரு பள்ளி 4 குழு தலைவர்களை (A, B, C, D) தேர்ந்தெடுக்க வேண்டும். A மற்றும் B ஒரே நேரத்தில் தலைவர்களாக இருக்க முடியாது, C மற்றும் D ஒரே நேரத்தில் தலைவர்களாக இருக்க வேண்டும். சாத்தியமான தேர்வு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["2", "3", "4", "5"],
        "a": "3"
    },
    {
        "q": "ஒரு பள்ளி 3 பயணத் திட்டங்களை (X, Y, Z) ஏற்பாடு செய்கிறது. X-இல் 20 மாணவர்கள், Y-இல் 30 மாணவர்கள், Z-இல் 40 மாணவர்கள் பங்கேற்கலாம். ஒரு பேருந்து 50 மாணவர்களை ஏற்றிச் செல்ல முடியும். குறைந்தபட்ச பேருந்துகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["2", "3", "4", "5"],
        "a": "2"
    },
    {
        "q": "ஒரு பள்ளி 4 திட்டங்களை (A, B, C, D) மேற்கொள்கிறது. A-இல் 1000 ரூ, B-இல் 1500 ரூ, C-இல் 2000 ரூ, D-இல் 2500 ரூ செலவு. பட்ஜெட் 4000 ரூ. எந்த திட்டங்களை முடிக்க முடியும்?",
        "o": ["A மற்றும் B", "B மற்றும் C", "A மற்றும் C", "C மற்றும் D"],
        "a": "A மற்றும் B"
    },
    {
        "q": "ஒரு பள்ளி 3 ஆசிரியர்களை (P, Q, R) 3 பயிற்சி அமர்வுகளுக்கு ஒதுக்க வேண்டும். P ஆனவர் அமர்வு 1-ஐ ஏற்க முடியாது, Q ஆனவர் அமர்வு 2-ஐ ஏற்க முடியாது. சாத்தியமான ஒதுக்கீடு வழிகளின் எண்ணிக்கையைக் கண்டறியவும்.",
        "o": ["2", "3", "4", "6"],
        "a": "4"
    },
    {
        "q": "ஒரு பள்ளி 4 நிகழ்ச்சி இடங்களை (A, B, C, D) ஒதுக்க வேண்டும். A-இல் 30 பேர், B-இல் 40 பேர், C-இல் 50 பேர், D-இல் 60 பேர் அமர முடியும். 100 பேர் பங்கேற்க வேண்டும். எந்த இடங்களைத் தேர்ந்தெடுக்க வேண்டும்?",
        "o": ["C மற்றும் D", "A மற்றும் D", "B மற்றும் C", "A மற்றும் C"],
        "a": "C மற்றும் D"
    },
    {
        "q": "ஒரு பள்ளி 3 விளையாட்டு அணிகளை (X, Y, Z) உருவாக்க வேண்டும். X-இல் 4 மாணவர்கள், Y-இல் 5 மாணவர்கள், Z-இல் 6 மாணவர்கள் இருக்க வேண்டும். மொத்தம் 12 மாணவர்கள் உள்ளனர். எந்த அணிகளை உருவாக்க முடியும்?",
        "o": ["X மற்றும் Y", "Y மற்றும் Z", "X மற்றும் Z", "எதுவும் இல்லை"],
        "a": "X மற்றும் Y"
    },
    {
        "q": "ஒரு பள்ளி 3 கலை நிகழ்ச்சிகளை (P, Q, R) ஏற்பாடு செய்கிறது. P-இல் 1500 ரூ செலவு, Q-இல் 2000 ரூ செலவு, R-இல் 2500 ரூ செலவு. பட்ஜெட் 4000 ரூ. எந்த நிகழ்ச்சிகளை நடத்த முடியும்?",
        "o": ["P மற்றும் Q", "Q மற்றும் R", "P மற்றும் R", "எதுவும் இல்லை"],
        "a": "P மற்றும் Q"
    }
]